Tekla.Structures.Drawing.DotPrintPaperSize
The paper size.

Tekla.Structures.Drawing.DotPrintPaperSize.Auto
Printer output type.

Tekla.Structures.Drawing.DotPrintPaperSize.A0
A0 paper size.

Tekla.Structures.Drawing.DotPrintPaperSize.A1
A1 paper size.

Tekla.Structures.Drawing.DotPrintPaperSize.A2
A2 paper size.

Tekla.Structures.Drawing.DotPrintPaperSize.A3
A3 paper size.

Tekla.Structures.Drawing.DotPrintPaperSize.A4
A4 paper size.

Tekla.Structures.Drawing.DotPrintPaperSize.A5
A5 paper size.